app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "SChool Class"], ["room_number", 102], ["created_at", "2019-03-18 20:48:42.576059"], ["updated_at", "2019-03-18 20:48:42.576059"]]
---
  def create
    school_class = SchoolClass.create(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-03-18 18:12:21.793278"], ["id", 1]]
---
  def update
    school_class = SchoolClass.find(params[:id])
    school_class.update(school_class_params)