app/controllers/students_controller.rb

  def create
    @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Morpley"], ["last_name", "Hammerbuck"], ["created_at", "2019-03-18 20:31:05.031151"], ["updated_at", "2019-03-18 20:31:05.031151"]]

  def update
    @student = Student.find(params[:id])
    # byebug
    @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2019-03-18 20:21:30.080094"], ["id", 2]]